### Import the library and set your sqllite path directory.

In [1]:
import sys 
import pandas as pd
import sqlite3 

data_directory = "your~sqllite~path\database.sqlite"

In [2]:
from sqlLite2Pandas import SqlLite2Pandas

In [3]:
sql_data = SqlLite2Pandas(data_dir)

### Show all available tables

In [4]:
sql_data.show_tables()

['Country',
 'League',
 'Match',
 'Player',
 'Player_Attributes',
 'Team',
 'Team_Attributes',
 'sqlite_sequence']

### Show a table's column details.

In [5]:
sql_data.show_columns_details("Country")

[{'column_id': 0,
  'column_name': 'id',
  'datatype': 'INTEGER',
  'default_value': None,
  'nullable': False,
  'primary_key': True},
 {'column_id': 1,
  'column_name': 'name',
  'datatype': 'TEXT',
  'default_value': None,
  'nullable': False,
  'primary_key': False}]

### Convert sqllite to pandas for a tables.

In [6]:
df = sql_data.to_pandas('Country')   
df.head()

      id     name
0      1  Belgium
1   1729  England
2   4769   France
3   7809  Germany
4  10257    Italy